rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "D1"]]
SELECT "movies".* FROM "movies"
---
  def same_director
    id = params[:id]
    @movie = Movie.find(id)

    @movies_with_the_same_director = @movie.find_all_by_director
    if @movie.director.blank?